CSI API ETABS v1

# cDStCanadian_S16_14GetPreference Method

---

Retrieves the value of a steel design preference item

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPreference(
    	int Item,
    	ref double Value
    )

    Function GetPreference (
    	Item As Integer,
    	ByRef Value As Double
    ) As Integer

    Dim instance As cDStCanadian_S16_14
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.GetPreference(Item,
    	Value)

    int GetPreference(
    	int Item,
    	double% Value
    )

    abstract GetPreference :
            Item : int *
            Value : float byref -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 21, inclusive, indicating the preference item
considered

  1. Multi-response case design
  2. Framing type
  3. Spectral Acceleration Ratio, Ie*Fa*Sa(0.2)
  4. Ductility related modification factor, Rd
  5. Overstrength related modification factor, Ro
  6. Capacity factor, Phi bending
  7. Capacity factor, Phi compression
  8. Capacity factor, Phi tension
  9. Capacity factor, Phi shear
  10. Slender section modification
  11. Ignore seismic code
  12. Ignore special seismic load
  13. Doubler plate is plug welded
  14. Consider deflection
  15. DL deflection limit, L/Value
  16. SDL + LL deflection limit, L/Value
  17. LL deflection limit, L/Value
  18. Total load deflection limit, L/Value
  19. Total camber limit, L/Value
  20. Pattern live load factor
  21. Demand/capacity ratio limit

Value

    Type: SystemDouble
The value of the considered preference item

  1. Multi-response case design
     * **1** \- Envelopes
     * **2** \- Step-by-step
     * **3** \- Last step
     * **4** \- Envelopes -- All
     * **5** \- Step-by-step -- All
  2. Framing type
     * **1** \- Type LD MRF
     * **2** \- Type MD MRF
     * **3** \- Type D MRF
     * **4** \- Type LD CBF(V)
     * **5** \- Type LD CBF(TC)
     * **6** \- Type LD CBF(TO)
     * **7** \- Type LD CBF(OT)
     * **8** \- Type MD CBF(V)
     * **9** \- Type MD CBF(TC)
     * **10** \- Type MD CBF(TO)
     * **11** \- Type MD CBF(OT)
     * **12** \- EBF
     * **13** \- Cantilever Column
     * **14** \- Conventional MF
     * **15** \- Conventional BF
  3. Spectral Acceleration Ratio, Ie*Fa*Sa(0.2)

Value > 0

  4. Ductility related modification factor, Rd

Value > 0

  5. Overstrength related modification factor, Ro

Value > 0

  6. Capacity factor, Phi bending

Value > 0

  7. Capacity factor, Phi compression

Value > 0

  8. Capacity factor, Phi tension

Value > 0

  9. Capacity factor, Phi shear

Value > 0

  10. Slender section modification
     * **1** \- modified geometry
     * **2** \- modified Fy
  11. Ignore seismic code
     * 0 = No
     * Any other value = Yes
  12. Ignore special seismic load
     * 0 = No
     * Any other value = Yes
  13. Doubler plate is plug welded
     * 0 = No
     * Any other value = Yes
  14. Consider deflection
     * 0 = No
     * Any other value = Yes
  15. DL deflection limit, L/Value

Value > 0

  16. SDL + LL deflection limit, L/Value

Value > 0

  17. LL deflection limit, L/Value

Value > 0

  18. Total deflection limit, L/Value

Value > 0

  19. Total camber limit, L/Value

Value > 0

  20. Pattern live load factor

Value >= 0

  21. Demand/capacity ratio limit

Value > 0

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise, it returns a
nonzero value

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("CSA S16-14")

    'get preference item
       ret = SapModel.DesignSteel.Canadian_S16_14.GetPreference(4, Value)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStCanadian_S16_14 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com